Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--istsos_quickstart.tmx
Source language: en
Languages: ja

source: istSOS Quickstart
ja: istSOSクイックスタート

source: istSOS is an OGC |SOS| server implementation written in `Python <https://www.python.org/>`__. istSOS allows for managing and dispatch observations from monitoring sensors according to the Sensor Observation Service standard.
ja: istSOSは、`Python<https://www.python.org/>`__ で記述されたOGC |SOS|サーバ実装です。istSOSは、Sensor Observation Service標準に従って、モニタリングセンサーからの観測情報を管理し、ディスパッチすることを可能にします。

source: The project provides also a Graphical user Interface that allows for easing the daily operations and a RESTFull Web api for automatizing administration procedures.
ja: このプロジェクトはまた、日常的な操作を容易にするグラフィカル・ユーザー・インターフェースと、管理手順を自動化するためのRESTフル Web apiも提供しています。

source: istSOS is released under the GPLv2 licence, and runs on all major platforms (Windows, Linux, Mac OS X), even though it has been used in production in linux environment only.
ja: istSOSはGPLv2ライセンスでリリースされ、すべての主要プラットフォーム(Windows、Linux、Mac OS X)で動作します。ただし、これまでLinux環境でのみ使用されていました。

source: Create postgis database
ja: postgisデータベースを作成する

source: Open a terminal and execute the following commands:
ja: 端末を開き、次のコマンドを実行します:

source: Set up an istSOS service instance
ja: istSOSサービスインスタンスを設定する

source: With istSOS you can organize your sensor data in different instances. Every instance has its own database schema independent from other instances. You can even deploy other databases over your network according to your needs.
ja: istSOSを使用すると、センサーデータをさまざまなインスタンスまとめることができます。すべてのインスタンスには、他のインスタンスから独立した独自のデータベーススキーマがあります。必要に応じて、ネットワーク上に他のデータベースを展開することもできます。

source: The first steps into istSOS setup is to configure the default configuration options. These options will then be automatically used for your convenience by every new istSOS instance created.
ja: istSOSセットアップの最初のステップは、デフォルトの設定オプションを設定することです。これらのオプションは、新しいistSOSインスタンスが作成されるたびに自動的に使用されます。

source: Click :menuselection:`Geospatial --> Webservices --> istSOS` to open the Web Admin interface. Alternatively, open a browser and go to `<http://localhost/istsos/admin>`_
ja: :menuselection:`Geospatial-->Webservices-->istSOS`をクリックして、Web Adminインターフェイスを開きます。または、ブラウザを開き、`<http://localhost/istsos/admin>`_に移動します。

source: Click the :guilabel:`Enter` button in the administration page.
ja: 管理ページで:guilabel:`Enter`ボタンをクリックします。

source: Configure your database connection. From the toolbar buttons menu, press the "Database" button and fill in the database configuration options:
ja: データベース接続を設定します。ツールバーのボタンメニューから、"Database"ボタンを押し、データベース設定オプションを入力します。

source: Press the "Service provider" button and fill it using your institutional information.
ja: "Service provider"ボタンを押して、施設情報を使用して入力します。

source: Press the "Service identification" button and fill up with custom metadata that describe the service usage.
ja: "Service identification"ボタンを押して、サービスの使用状況を説明するカスタムメタデータを入力します。

source: Press the "Coordinates system" button to manage the Coordinate Reference System (CRS).
ja: 座標参照系(CRS)を管理するには、"Coordinates system" ボタンを押します。

source: *Default EPSG code*: this will be the native Coordinate Reference System of your geometries in the database.
ja: *Default EPSG code*:これはデータベース内のジオメトリのネイティブの座標参照システムになります。

source: *Permitted EPSG*: here you can configure which other Coordinate Reference Systems your system will support and reproject if requested.
ja: *Permitted EPSG*: ここでは、システムがサポートして再投影する他の座標参照系を設定できます。

source: From the toolbar buttons menu, press the "GetObservation Configuration" button to set maximum time interval per getObservation request (zero for no limits) and aggregation no-data value.
ja: ツールバーのボタンメニューから、"GetObservation Configuration"ボタンを押して、getObservation要求ごとの最大時間間隔(無制限の場合は0)と集計のno-data値を設定します。

source: Configure your service proxy address. The Proxy URL field is the base URL seen beyond a reverse proxy.
ja: サービスプロキシアドレスを設定します。プロキシURLフィールドは、リバースプロキシ越しで見えるベースのURLをいれます。

source: Create a new service
ja: 新しいサービスを作成する

source: Now that you have configured istSOS, it's time to create a new service instance.
ja: istSOSを設定したので、次は新しいサービスインスタンスを作成します。

source: From the toolbar buttons menu press the "new service" button and click :guilabel:`Next`.
ja: ツールバーのボタンメニューから"new service"ボタンを押し、:guilabel:`Next`をクリックします。

source: Type **demo** for the Service name.
ja: サービス名に**demo**と入力します。

source: In the EPSG field you can set the database native projection. Leave it empty to use the default. Click :guilabel:`Next`.
ja: EPSGフィールドでは、データベースのネイティブ投影を設定できます。デフォルトを使用する場合は空のままにします。:guilabel:`Next`をクリックします。

source: Clicking on the "Customize database" box, you are able to change the default database configuration for this new istSOS instance.
ja: "Customize database"ボックスをクリックすると、この新しいistSOSインスタンスのデフォルトデータベース設定を変更できます。

source: Press :guilabel:`Next`. The server status panel is displayed. If something's gone wrong during the creation you will see an alert here.
ja: :guilabel:`Next`を押します。サーバステータスパネルが表示されます。作成中に何か問題が発生した場合ここに警告が表示されます。

source: The istSOS “demo” instance has inherited all the configuration options from the default configuration. If, for any reason you decide to modify them, the changes will affect only this instance.
ja: istSOSの"demo"インスタンスは、デフォルト設定からすべての設定オプションを継承しています。何らかの理由で変更した場合、変更はこのインスタンスにのみ影響します。

source: Add a new procedure
ja: 新しいプロシージャを追加する

source: From the “services” drop down button of the admin interface (http://localhost/istsos/admin ) choose the desired instance.
ja: 管理インターフェイス(http://localhost/istsos/admin)の"services"ドロップダウンボタンから、目的のインスタンスを選択します。

source: From the toolbar buttons menu press the :guilabel:`New procedure` button.
ja: ツールバーのボタンメニューから:guilabel:`New procedure`ボタンを押します。

source: Fill in the form using appropriate information.
ja: 適切な情報を使用してフォームに入力します。

source: Once a procedure is created the outputs (observed properties) cannot be changed.
ja: プロシージャが作成されると、出力(観測されたプロパティ)は変更できません。

source: *Optional parameters:* Fill at your own need and willing
ja: *Optional parameters:*必要に応じて自由に入力してください

source: *Example* (minimal configuration)
ja: *例*(最小構成)

source: *Outputs (confirm the outputs pressing the "add" button):*
ja: *出力("add"ボタンを押して出力を確認):*

source: Observed property: urn:ogc:def:parameter:x-istsos:1.0:meteo:air:temperature
ja: 観測されたプロパティ:urn:ogc:def:parameter:x-istSOS:1.0:meteo:air:temperature

source: Unit of measure: °C
ja: 単位:°C

source: Description (optional): conversion from resistance to temperature
ja: 説明(オプション): 抵抗値から温度への変換

source: quality index check (optional): Between / from -40 to +60
ja: 品質指数チェック(オプション):-40から+60まで

source: Register the new sensor (procedure) pressing the "submit" button.
ja: "submit"ボタンを押して、新しいセンサー(プロシージャ)を登録します。

source: Add new observations
ja: 新しい観測情報を追加する

source: First we will create a text file with sensor data, formatted according to "text/csv, subtype=istSOS". The file uses a Comma Separated Values (CSV) format. The first line contains header information, including URI names of the observed properties. The following lines contain the data.
ja: まず、"text/csv,subtype=istSOS"に従ってフォーマットされたセンサーデータのテキストファイルを作成します。このファイルはCSV(カンマ区切りテキスト)形式を使用しています。最初の行には、観測されたプロパティのURI名を含むヘッダ情報が含まれます。次の行にデータが含まれています。

source: Open a text editor by selecting :menuselection:`Accessories --> FeatherPad`.
ja: :menuselection:`アクセサリ-->FeatherPad`を選択して、テキストエディタを開きます。

source: Open a terminal by selecting :menuselection:`Accessories --> LXTerminal`.
ja: Open a terminal by selecting :menuselection:`システムツール --> LXTerminal`.

source: In the terminal, enter: "cd /usr/share/istsos/" and press ENTER.
ja: 端末で:"cd/usr/share/istSOS/"と入力し、ENTERを押します。

source: Write "python scripts/csv2istsos.py -p T_LUGANO -u http://localhost/istsos -s demo -w ~/Desktop" and press ENTER
ja: "python scripts/csv2istsos.py -p T_LUGANO -u http://localhost/istsos -s demo -w ~/Desktop" とうちこんで、ENTERを押します

source: You should see a message "Insert observation success: True"
ja: "Insert observation success:True"というメッセージが表示されます。

source: Click :menuselection:`Geospatial --> Webservices --> istSOS`.
ja: :menuselection:`Geospatial-->Webservices-->istSOS`をクリックします。

source: Click the :guilabel:`Enter` button in the administration page
ja: 管理ページで:guilabel:`Enter`ボタンをクリックします

source: Click :menuselection:`Data Management --> Data Viewer`.
ja: :menuselection:`Data Management-->Data Viewer`をクリックします。

source: Select the following:
ja: 次を選択してください:

source: Click the :guilabel:`Add` button
ja: :guilabel:`Add`ボタンをクリックします

source: Click the :guilabel:`Plot` button and check that the data have been added (watch out at your time zone!)
ja: :guilabel:`Plot`ボタンをクリックし、データが追加されたことを確認します(タイムゾーンに注意してください)。

source: What next?
ja: 次のステップ

source: To learn more about istSOS, a starting point is the `istSOS Documentation`_ and the `istSOS Tutorial`_.
ja: istSOSについてさらに学ぶには、 `istSOS Documentation`_ と `istSOS Tutorial`_を参照してください。
